# #-----------------ТИПЫ данных---------------------#
# # comment  либо ctrl + /

# # примитивные типы данных
# # int (integer) 5
# # float  5.0
# # str (string) "5", '5', """5""", '''5'''
# # bool (boolean)
# # None - (NoneType)  пустота 
# # и т.д.


# n = 5
# print(5 + 6) # print() - функция = действие (набор действий)

# print(type(5))
# print(type("5"))
# print(type(5.0))
# print(type(True))
# print(type(None))


# # v = 4 # v - переменная 
# book = """ Onegin
# is written by Pushkin"""
# print(f"{book} - {type(book)} \n")
# print("""A.S. Pushkin     
# Onegin""")                                                                  



# ------------------- print() ----------------- #
# # variables* -  0, 1... бесконечность
# # sep - separator - разделитель - необязательный
# # end -  символ окончание вывода - необязательный
# # print(variables*, sep, end) variables, sep, end - параметры, агрументы

# print("Petya", "Vasya", "Kolya")
# print("Petya", "Vasya", "Kolya", sep = ", "  )
# print("Petya", end="\n*")
# print("Vasya", end="\n*")
# print("Kolya", end="\n*")
# print()









# коллекционные типы данных (много значений)
# list
# tuple
# dict (dictionary )
# range 
# set 


# ------------------------ Арифмитеческие операторы -------------------------------------#
# opertor:   + - / *  **  %  // 
# %   - деление, при котором остается только остаток
# // - деление, при котором остается только целая часть


# #------------------------Задача------------------------------------#
# """
# дана  переменная n = 5, 
# необходимо напечтать результат деления на 2, 
# целую часть и остаток
# """

# n = 5 
# print(f"{n} / 2 = {n/2} \ndiv ={n//2} \nmod = {n%2}")



# #------------------------Задача------------------------------------#

# """
# Дано две цифры. Необходимо создать число, 
# содержащее эти цифры. 
# Например 9, 7, тогда нужно сформировать число 97.
# """
# # n1, n2 = 9, 7
# # print(int(str(n1)+str(n2)))

# # # 2 способ  
# # n1, n2 = 9, 7
# # res = n1*10 + n2
# # print(res)


# # #------------------------Задача------------------------------------#
# """
# Дан прямоугольник размером a(м) x b(м). 
# Сколько квадратов (целое число квадратов) со стороной d (см)
# Для решения задачи использовать переменные для задания 
# размеров прямоугольника
# а также переменную для записи результата
# """
# # 1. ввод данных (длина - a | ширина -b)
# a = 10
# b = 30
# d = 30

# # 2. алгоритм
# #   2.1 вычислить площадь комнаты (a*b*1000)
# S_room =  a * b * 1000

# #   2.2 вычислить площадь квадрата (d*d)
# S_square = d * d

# #   2.3 посчитаем кол-во целых квадартов на комнату ((a * b * 1000) // (30 * 30))
# res = S_room // S_square
# print(res)



from turtle import *
from time import *

shape("turtle")
# #----------------- Задача --------------------#
# # нарисовать квадрат (кол-во сторон = 4)
# forward(100) # вперед
# left(90) #налево(90)

# forward(100) # вперед
# left(90) #налево(90)

# forward(100) # вперед
# left(90) #налево(90)

# forward(100) # вперед
# left(90) #налево(90)

# #----------------- Задача --------------------#
# # нарисовать равносторонний треугольник 
# # кол-во сторон = 3 и все одинаковые 
# # угол треугольника  = 60 град

# angle = 180-60

# forward(100)
# left(angle)
# forward(100)
# left(angle)
# forward(100)
# left(angle)


# # еще команды
# color("red")
# circle(radius=100, extent=180) #extent -необязательный (сектор)


#----------------- Задача --------------------#
# задание черепешка 4.gif задача

# одна сторона
color('blue')
forward(100)
color('red')
forward(100)
left(90)

# одна сторона
color('blue')
forward(100)
color('red')
forward(100)
left(90)

# одна сторона
color('blue')
forward(100)
color('red')
forward(100)
left(90)

# одна сторона
color('blue')
forward(100)
color('red')
forward(100)
left(90)



sleep(5)